// pages/about/about.js
Page({

  /**
   * 页面的初始数据
   */
  data: {
    text1:"移动互联网的发展和移动用户的增长催生了移动服务的兴起，电子阅读逐渐开始代替纸质阅读，图书阅读的发展也需要跟上脚步，我们希望用户在继续进行纸质阅读的同时通过与小程序的结合，为图书的阅读提供一个新的平台和环境。",
    text2:"用户可以选择将自己闲置的图书通过本平台分享给其他用户，同时也可以通过本平台借阅已有的其他图书或是直接在本平台进行阅读。",
    text3:"相信这种方式也比较符合年轻人对手机的使用习惯，也希望借此机会能够继续推动图书阅读未来的发展。"
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad(options) {

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady() {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow() {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide() {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload() {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh() {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom() {

  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage() {

  }
})